Revit 2026 API

# InsulationTypeSetClear Method

---

Removes every insulation type from the set, rendering it empty.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void Clear()
```
```vb
Public Overridable Sub Clear
```
```cpp
public:
virtual void Clear()
```
```fsharp
abstract Clear : unit -> unit
override Clear : unit -> unit
```

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace